Pandas has :
    1:Series - 1d Array
    2:DataFrame - Structure of altered collections

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\shrey\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\shrey\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\shrey\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in c:\users\shrey\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\shrey\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [3]:
print(pd.__version__)

1.5.3

# Series

In [4]:
list= [1,2,3,4,5]

In [6]:
list

[1, 2, 3, 4, 5]

In [10]:
type(list)

list

In [21]:
ser= pd.Series(list)
ser

0    1
1    2
2    3
3    4
4    5
dtype: int64

Difference between series and numpy array 
In numpy you cannot change index but  in series you can change indexes according to yourself and you can store 
any kind of datatype

One more differnece is for eg if number of rows is more than 500k then pandas is prefferable , Pandas perform 
better with this much large amound of data .

In [22]:
label=['a','b','c','d','e']

In [23]:
ser= pd.Series(list,label)
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [24]:
Marks= {"maths":43,"Science":80,"Social":46,"English":70}
Ser= pd.Series(Marks)

In [25]:
Ser

maths      43
Science    80
Social     46
English    70
dtype: int64

In [26]:
Ser=pd.Series(Marks,["maths","Science","Social"])

In [27]:
Ser

maths      43
Science    80
Social     46
dtype: int64

# Series Indexing

In [28]:
Ser

maths      43
Science    80
Social     46
dtype: int64

In [29]:
Ser[1]

80

In [30]:
Ser["Science"]

80

# Slicing

# Ser[1:3]

In [31]:
#other way
Ser[1:]

Science    80
Social     46
dtype: int64

In [32]:
Ser.shape

(3,)

In [33]:
type(Ser)

pandas.core.series.Series

# DATAFRAME

In [34]:
list=[[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16]]
df=pd.DataFrame(list)

In [35]:
df

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [36]:
col=["A","B","C","D"]
row=["a","b","c","d"]
df=pd.DataFrame(list,index=row,columns=col)
df

    A   B   C   D
a   1   2   3   4
b   5   6   7   8
c   9  10  11  12
d  13  14  15  16

In [37]:
df=pd.DataFrame({"Name":["AA","BB","CC","DD"],"Age":[10,14,34,15],"Branch":["AI","ML","ECE","MECH"]})

In [38]:
df

  Name  Age Branch
0   AA   10     AI
1   BB   14     ML
2   CC   34    ECE
3   DD   15   MECH

In [39]:
type(df)

pandas.core.frame.DataFrame

In [40]:
df.shape

(4, 3)

In [41]:
df.columns

Index(['Name', 'Age', 'Branch'], dtype='object')

In [42]:
#if we want to rename

df1=df.rename(columns={"Name":"ZumiZumi"})
df1

  ZumiZumi  Age Branch
0       AA   10     AI
1       BB   14     ML
2       CC   34    ECE
3       DD   15   MECH

In [43]:
df.columns[[0,1]]

Index(['Name', 'Age'], dtype='object')

In [44]:
df.columns.values

array(['Name', 'Age', 'Branch'], dtype=object)

In [45]:
df.columns.values[2]

'Branch'

In [46]:
#other way of renaming
df1.columns.values[2]="ZumiBranch"
df1

  ZumiZumi  Age ZumiBranch
0       AA   10         AI
1       BB   14         ML
2       CC   34        ECE
3       DD   15       MECH

In [47]:
#deleting a column
df.drop("Age",axis=1)

  Name Branch
0   AA     AI
1   BB     ML
2   CC    ECE
3   DD   MECH

In [48]:
df

  Name  Age Branch
0   AA   10     AI
1   BB   14     ML
2   CC   34    ECE
3   DD   15   MECH

In [49]:
#you have to commit to save changes
df.drop("Age",axis=1,inplace = True)

In [50]:
df

  Name Branch
0   AA     AI
1   BB     ML
2   CC    ECE
3   DD   MECH

In [51]:
#adding a column
df["place"]=["Hyd","Vellore","Del","UP"]
df

  Name Branch    place
0   AA     AI      Hyd
1   BB     ML  Vellore
2   CC    ECE      Del
3   DD   MECH       UP

In [52]:
df1=df1.rename(columns={"Age":"ZumiAge","ZumiZumi":"Name","ZumiBranch":"Branch"})

In [53]:
df1

  Name  ZumiAge Branch
0   AA       10     AI
1   BB       14     ML
2   CC       34    ECE
3   DD       15   MECH

In [54]:
df2=pd.concat([df,df1])

In [55]:
df2

  Name Branch    place  ZumiAge
0   AA     AI      Hyd      NaN
1   BB     ML  Vellore      NaN
2   CC    ECE      Del      NaN
3   DD   MECH       UP      NaN
0   AA     AI      NaN     10.0
1   BB     ML      NaN     14.0
2   CC    ECE      NaN     34.0
3   DD   MECH      NaN     15.0

# Handle Missing Values

1. deleting row and column

2. imputing the value (filling null value with something)

In [57]:
d

NameError: name 'd' is not defined

In [58]:
import numpy as np
df1=pd.DataFrame({'Name':['tulasi',np.nan,'supriya',np.nan,'saanvi','saanvi'],'score1':[5,4,np.nan,np.nan,4,5],'score2':[np.nan,5,9,np.nan,4,5]})
df1

      Name  score1  score2
0   tulasi     5.0     NaN
1      NaN     4.0     5.0
2  supriya     NaN     9.0
3      NaN     NaN     NaN
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [59]:
df1.isnull()

    Name  score1  score2
0  False   False    True
1   True   False   False
2  False    True   False
3   True    True    True
4  False   False   False
5  False   False   False

In [61]:
df1.isnull().any()

Name      True
score1    True
score2    True
dtype: bool

In [62]:
df1.isnull().sum()

Name      2
score1    2
score2    2
dtype: int64

1 deleting

In [63]:
df1.dropna(inplace=True)

In [64]:
df1

     Name  score1  score2
4  saanvi     4.0     4.0
5  saanvi     5.0     5.0

In [65]:
df1=pd.DataFrame({'Name':['tulasi',np.nan,'supriya',np.nan,'saanvi','saanvi'],'score1':[5,4,np.nan,np.nan,4,5],'score2':[np.nan,5,9,np.nan,4,5]})
df1

      Name  score1  score2
0   tulasi     5.0     NaN
1      NaN     4.0     5.0
2  supriya     NaN     9.0
3      NaN     NaN     NaN
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [66]:
df1.dropna(axis=1,inplace=True)
df1

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

#imputing the values 

Mean -> 1+2+3+4+5+5/5
Median -> 3+4/2
Mode -> 5  (most occuring value)

In [67]:
df1=pd.DataFrame({'Name':['tulasi',np.nan,'supriya',np.nan,'saanvi','saanvi'],'score1':[5,4,np.nan,np.nan,4,5],'score2':[np.nan,5,9,np.nan,4,5]})
df1

      Name  score1  score2
0   tulasi     5.0     NaN
1      NaN     4.0     5.0
2  supriya     NaN     9.0
3      NaN     NaN     NaN
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [68]:
df1["score1"].mean()

4.5

In [69]:
df1["score1"]=df1["score1"].fillna(df1["score1"].mean()) #prefferable to use mean mostly

In [70]:
df1

      Name  score1  score2
0   tulasi     5.0     NaN
1      NaN     4.0     5.0
2  supriya     4.5     9.0
3      NaN     4.5     NaN
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [71]:
df1["score2"]=df1["score2"].fillna(df1["score2"].median())

In [72]:
df1

      Name  score1  score2
0   tulasi     5.0     5.0
1      NaN     4.0     5.0
2  supriya     4.5     9.0
3      NaN     4.5     5.0
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [73]:
df1["Name"].mode()

0    saanvi
Name: Name, dtype: object

In [74]:
df1["Name"]=df1["Name"].fillna(df1["Name"].mode()[0])  #[0] got grab value of sanvi

In [75]:
df1

      Name  score1  score2
0   tulasi     5.0     5.0
1   saanvi     4.0     5.0
2  supriya     4.5     9.0
3   saanvi     4.5     5.0
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [76]:
#to get how many number of times specific entity ocuured

df1.Name.value_counts()

saanvi     4
tulasi     1
supriya    1
Name: Name, dtype: int64

In [77]:
group = df1.groupby("Name")

In [78]:
group

In [79]:
group.mean()

         score1  score2
Name
saanvi    4.375    4.75
supriya   4.500    9.00
tulasi    5.000    5.00

In [80]:
df1

      Name  score1  score2
0   tulasi     5.0     5.0
1   saanvi     4.0     5.0
2  supriya     4.5     9.0
3   saanvi     4.5     5.0
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [81]:
df1.shape

(6, 3)

In [82]:
df1.head(2)

     Name  score1  score2
0  tulasi     5.0     5.0
1  saanvi     4.0     5.0

In [83]:
df1.tail(3)

     Name  score1  score2
3  saanvi     4.5     5.0
4  saanvi     4.0     4.0
5  saanvi     5.0     5.0

# Accessing rows and columns

#using slicing
loc - to access location

iloc -

In [84]:
a=df1.loc[0] # returns a pandas series
a

Name      tulasi
score1       5.0
score2       5.0
Name: 0, dtype: object

In [85]:
type(a)

pandas.core.series.Series

In [86]:
df1.loc[0:2]

      Name  score1  score2
0   tulasi     5.0     5.0
1   saanvi     4.0     5.0
2  supriya     4.5     9.0

In [87]:
df2=df1.loc[0]

In [88]:
df2

Name      tulasi
score1       5.0
score2       5.0
Name: 0, dtype: object

In [89]:
type(df2)

pandas.core.series.Series

In [90]:
type(df1)

pandas.core.frame.DataFrame

In [91]:
data={
    "calories":[420,125,154],
    "duration":[50,40,45]
}

In [92]:
data

{'calories': [420, 125, 154], 'duration': [50, 40, 45]}

In [93]:
import pandas as pd

In [94]:
df=pd.DataFrame(data,index=["day1","day2","day3"])

In [95]:
df

      calories  duration
day1       420        50
day2       125        40
day3       154        45

In [96]:
df.loc["day2"]

calories    125
duration     40
Name: day2, dtype: int64

loc----labelled indexs
iloc---integer based indexes

In [98]:
df=pd.DataFrame({"Name":["vishwa","Saanvi","chetan","priya"],"Age":[2,5,10,15],"Branch":["AI","ML","ECE","EEE"]})

In [99]:
df

     Name  Age Branch
0  vishwa    2     AI
1  Saanvi    5     ML
2  chetan   10    ECE
3   priya   15    EEE

In [100]:
df.iloc[1:3,0:2]

     Name  Age
1  Saanvi    5
2  chetan   10

In [101]:
df.iloc[2:,1:3]

   Age Branch
2   10    ECE
3   15    EEE

In [102]:
df.iloc[3:,0:1]

    Name
3  priya

In [103]:
df.iloc[3:,:1]

    Name
3  priya

In [104]:
df.loc[:,["Name","Branch"]]

     Name Branch
0  vishwa     AI
1  Saanvi     ML
2  chetan    ECE
3   priya    EEE